# PANDAS

* Pandas, veri analizi için kullanılan Python kitaplığıdır. Python'da kritik olan bir veri ile bir dizi veri araştırması, temizleme ve dönüşüm işlemi sunar.

* Pandas * üzerinde * numpy * ve * scipy  entegre edilerek kullanımı kolay veri yapıları ve veri düzenleme işlevleri sağlar.

* Ana veri yapıları * Series * ve * DataFrame * olmak üzere 2 tanedir.

Öncelikle Pandas için bilgisayarınızda Jupyter NoteBook yüklü olması gerekiyor. Kendi bilgisayarınızda çalışmak istiyorsanız [Anaconda](https://www.continuum.io/downloads) programını yüklemeniz gerekmektedir.Eğer online olarak çalışmak isterseniz [Big Data University (BDU Labs)](https://my.datascientistworkbench.com) adresine gidip üyelik açıp kullanabilirsiniz.

## Pandas Kütüphanesini Import Edelim

In [2]:
import pandas as pd

## Pandas Veri Yapılarına Giriş

## Pandas Series

Tek boyutlu *dizi* (array)

In [4]:
ser = pd.Series([1,2,3,4],['a','b','c','d'])

Burada bilmeniz gereken şey dizinin tek boyutlu, ilk 4 değerin veri(data),diğer 4 değerin ise indeks(index) olduğudur.Eğer ser' i yadırmak istersek:

In [5]:
ser

a    1
b    2
c    3
d    4
dtype: int64

Data type'ın integer olduğunu görüyoruz.Şimdi dizimizin "a" indeksindeki elemanı karaktere çevirelim ve data type' da ki değişikliğe bakalım.

In [6]:
ser['a'] = 'foo'

In [7]:
ser

a    foo
b      2
c      3
d      4
dtype: object

Gördüğünüz gibi datatype objeye dönüştü.

Eğer indeksleri görmek istersek:

In [9]:
ser.index

Index(['a', 'b', 'c', 'd'], dtype='object')

Birden çok indeksteki değere nasıl ulaşırım.Bunun için 2 tane yol var. Birincisi loc[ ] , diğeri ise iloc[ ] (location)

In [10]:
ser.loc[['b','c']]

b    2
c    3
dtype: object

In [11]:
ser.iloc[[1,2]]

b    2
c    3
dtype: object

In [12]:
'a' in ser

True

Dizi elemanları 2 ile çarpalım

In [20]:
ser * 2

a    foofoo
b         4
c         6
d         8
dtype: object

Integer değerlerin 2 ile çarpıldığını, string'in ise 2 defa yazıldığını görüyoruz.

In [24]:
ser[['b','c']] ** 2 #1. ve 2. indeksin karesini aldık

b    4
c    9
dtype: object

# Pandas DataFrame

Pandas DataFrame, 2 boyutlu  bir veri yapısıdır.

## Sözlük kullanarak DataFrame nasıl oluşturulur

In [27]:
d  ={'bir' : pd.Series([10.,20.,30.],index = ['elma','armut','erik']),
     'iki' : pd.Series([111.,222.,333.,444], index = ['kiraz','muz','kivi','portakal'])}

In [28]:
df = pd.DataFrame(d)

In [30]:
df

           bir    iki
armut     20.0    NaN
elma      10.0    NaN
erik      30.0    NaN
kiraz      NaN  111.0
kivi       NaN  333.0
muz        NaN  222.0
portakal   NaN  444.0

Yukarıda gördüğünüz gibi **"bir"** ve **"iki"** kolon, indekslerimiz ise satır oldu.Tabloyu incelediğimizde, öreneğin **KİRAZ** indeksin kolon **bir** için **NaN** değer olduğunu görüyorsunuz.Yani böyle bir değer tanımlanmamış.

In [31]:
df.index

Index(['armut', 'elma', 'erik', 'kiraz', 'kivi', 'muz', 'portakal'], dtype='object')

In [32]:
df.loc['kiraz']

bir      NaN
iki    111.0
Name: kiraz, dtype: float64

In [33]:
df.columns

Index(['bir', 'iki'], dtype='object')

İndeksi verip değerleri alma

In [34]:
pd.DataFrame(d, index = ['muz','armut','kiraz'])

        bir    iki
muz     NaN  222.0
armut  20.0    NaN
kiraz   NaN  111.0

İndeksi ve kolonları belirtip değerleri alma

In [35]:
pd.DataFrame(d, index = ['elma','muz','armut'], columns = ['bir','üç'])

        bir   üç
elma   10.0  NaN
muz     NaN  NaN
armut  20.0  NaN

Yukarıda gördüğümüz gibi DataFrame 'mimizde  **3.**kolon olmadığı için bu değerler **NaN** döndü.

## Python sözlükler listesi ile DataFrame oluşturma

Sözlüklerden liste oluşturalım

In [38]:
data = [{'bmw': 1, 'mercedes': 2}, {'ferrari': 5, 'masserati': 10, 'bentley': 20}]

Oluşturduğumuz listeden DataFrame yaratalım.

In [51]:
 pd.DataFrame(data)

   bentley  bmw  ferrari  masserati  mercedes
0      NaN  1.0      NaN        NaN       2.0
1     20.0  NaN      5.0       10.0       NaN

İndekslerimiz **1** ve **0** olarak gözüküyor.İsterseniz bunları **kırmızı** ve **siyah** olarak değiştirelim.

In [52]:
pd.DataFrame(data, index=['kırmızı', 'siyah'])

         bentley  bmw  ferrari  masserati  mercedes
kırmızı      NaN  1.0      NaN        NaN       2.0
siyah       20.0  NaN      5.0       10.0       NaN

## Basit DataFrame İşlemleri

In [53]:
df

           bir    iki
armut     20.0    NaN
elma      10.0    NaN
erik      30.0    NaN
kiraz      NaN  111.0
kivi       NaN  333.0
muz        NaN  222.0
portakal   NaN  444.0

In [55]:
df['bir']

armut       20.0
elma        10.0
erik        30.0
kiraz        NaN
kivi         NaN
muz          NaN
portakal     NaN
Name: bir, dtype: float64

Az önce 3. kolondaki değerleri **NaN** olarak görmüştük. Dilerseniz 3. kolona değer atayıp tekrar bakalım.

In [65]:
df['üç'] = df['bir'] * 10

In [66]:
df

           bir    iki     üç
armut     20.0    NaN  200.0
elma      10.0    NaN  100.0
erik      30.0    NaN  300.0
kiraz      NaN  111.0    NaN
kivi       NaN  333.0    NaN
muz        NaN  222.0    NaN
portakal   NaN  444.0    NaN

In [67]:
df['kontrol'] = df['üç'] > 100

In [68]:
df

           bir    iki     üç  kontrol
armut     20.0    NaN  200.0     True
elma      10.0    NaN  100.0    False
erik      30.0    NaN  300.0     True
kiraz      NaN  111.0    NaN    False
kivi       NaN  333.0    NaN    False
muz        NaN  222.0    NaN    False
portakal   NaN  444.0    NaN    False

Yukarıda şu işlemi yaptık: **3.** kolondaki değerlere bak, değeri **100**'den büyük olanları **TRUE** olarak işaretle.

Şimdide 3. kolonu çıkarıp, 3. ve kontrol sütunlarındaki değişime bakalım.

In [69]:
üç = df.pop('üç')

In [70]:
üç

armut       200.0
elma        100.0
erik        300.0
kiraz         NaN
kivi          NaN
muz           NaN
portakal      NaN
Name: üç, dtype: float64

In [71]:
df

           bir    iki  kontrol
armut     20.0    NaN     True
elma      10.0    NaN    False
erik      30.0    NaN     True
kiraz      NaN  111.0    False
kivi       NaN  333.0    False
muz        NaN  222.0    False
portakal   NaN  444.0    False

In [72]:
del df['iki']

In [73]:
df

           bir  kontrol
armut     20.0     True
elma      10.0    False
erik      30.0     True
kiraz      NaN    False
kivi       NaN    False
muz        NaN    False
portakal   NaN    False

### del ve pop arasındaki fark nedir ?

**del** bütün veriyi tamamen siler. **Pop** ise görünmez kılar. Tablodan çıkarılıyor olarak düşünebiliriz.

In [74]:
df.insert(2,'birinci_kolon_kopyası',df['bir'])

1. kolonun kopyasını 3. kolon olarak ekliyoruz.

In [75]:
df

           bir  kontrol  birinci_kolon_kopyası
armut     20.0     True                   20.0
elma      10.0    False                   10.0
erik      30.0     True                   30.0
kiraz      NaN    False                    NaN
kivi       NaN    False                    NaN
muz        NaN    False                    NaN
portakal   NaN    False                    NaN

In [76]:
df['üst_yarım'] = df['bir'][:3]

In [77]:
df

           bir  kontrol  birinci_kolon_kopyası  üst_yarım
armut     20.0     True                   20.0       20.0
elma      10.0    False                   10.0       10.0
erik      30.0     True                   30.0       30.0
kiraz      NaN    False                    NaN        NaN
kivi       NaN    False                    NaN        NaN
muz        NaN    False                    NaN        NaN
portakal   NaN    False                    NaN        NaN

Burada da birinci satırın orta indeksinden önceki değerleri alıp, üst_yarım adındaki sütuna ekledik.

**Sonraki yazımda DataSet okumayı ve bunlar üzerinde işlem yapmayı göstereceğim.